#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ProsperCI/AppServices/runs/run-kv2GgprDpWYdbXuC

Waiting for the plan to start...

Terraform v0.14.9
Configuring remote state backend...
Initializing Terraform configuration...
aws_s3_bucket.app: Refreshing state... [id=terraform-cloud-playground]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.app must be replaced
-/+ resource "aws_s3_bucket" "app" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::terraform-cloud-playground" -> (known after apply)
      ~ bucket                      = "terraform-cloud-playground" -> "terraform-cloud-playground-renamed" # forces replacement
      ~ bucket_domain_name          = "terraform-cloud-playground.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "terraform-cloud-playground.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "terraform-cloud-playground" -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "terraform-cloud-playground.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      ~ website {
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>
*Pusher: @cloudle, Action: `pull_request`*